Repository: CSchmuecki1970/K2MSA
Catalog: assets/l10n/app_*.arb
Languages: de

# appTitle
source: MSA Type 1 - Measurement System Analysis
de: MSA Typ 1 - Messsystemanalyse

source: Analysis Mode
de: Analysemodus

source: Import Measurements
de: Messwerte Importieren

# csvFailed
source: CSV Import Failed
de: CSV Import Fehlgeschlagen

# csvFailedDescription
source: Error importing CSV file: {error}
de: Fehler beim Importieren der CSV-Datei: {error}

# csvLoad
source: Load CSV
de: CSV laden

source: Save
de: Speichern

source: Load
de: Laden

source: Exit
de: Beenden

source: Loading...
de: Lädt...

# analysisTitle
source: Measurement System Analysis (AIAG Standard)
de: Messsystemanalyse (AIAG Standard)

# analysisSubtitle
source: Type 1 - Variables (Measurement Values)
de: Typ 1 - Variables (Messwerte)

# format1D
source: 1D: Column "x" with X-values
de: • 1D: Spalte "x" mit X-Werten

# format2D
source: 2D: Columns "x,y" with value pairs
de: • 2D: Spalten "x,y" mit Wertepaaren

# format2DDistances
source: 2D Distances: "x1,y1,x2,y2"
de: • 2D Distanzen: "x1,y1,x2,y2"

# fileWillBeAnalyzed
source: File will be automatically analyzed!
de: Die Datei wird automatisch analysiert!

# demoModeActivate
source: Activate Demo Mode
de: Demo Mode aktivieren

# firstSteps
source: Getting Started
de: Erste Schritte

# step1Title
source: Choose Analysis Mode
de: Analysemodus wählen

# step1Description
source: Select a demo mode (1D, 2D direct or 2D distances)
de: Wählen Sie einen Demo-Modus (1D, 2D direkt oder 2D Distanzen)

# step2Title
source: Fill Analysis Information
de: Analyse-Informationen ausfüllen

# step2Description
source: Enter part number, measuring instrument and other information (optional)
de: Geben Sie Teil-Nummer, Messmittel und weitere Informationen ein (optional)

# step3Title
source: Load CSV File or Use Demo
de: CSV-Datei laden oder Demo verwenden

# step3Description
source: Click "Load CSV" to choose your file, or enable "Demo Mode" for sample data
de: Klicken Sie auf "CSV laden" um Ihre Datei zu wählen, oder aktivieren Sie "Demo Mode" für Beispieldaten

# step4Title
source: Display Results
de: Ergebnisse anzeigen

# step4Description
source: After analysis, MSA results and ratings are displayed
de: Nach der Analyse werden die MSA-Ergebnisse und Bewertungen angezeigt

# step5Title
source: Export PDF
de: PDF exportieren

# step5Description
source: Export the complete report as PDF file
de: Exportieren Sie den vollständigen Bericht als PDF Datei

# noAnalysisData
source: No analysis data to export
de: Keine Analysedaten zum Exportieren

# pdfSaved
source: ✓ PDF saved: {path}
de: ✓ PDF gespeichert: {path}

# exportError
source: Error exporting: {error}
de: Fehler beim Exportieren: {error}

# analysisSaved
source: ✓ Analysis saved: {path}
de: ✓ Analyse gespeichert: {path}

# saveError
source: Error saving: {error}
de: Fehler beim Speichern: {error}

# analyticsData
source: Analysis Data
de: Analysedaten

# loadError
source: Error loading: {error}
de: Fehler beim Laden: {error}

# analysisLoaded
source: ✓ Analysis loaded: {name}
de: ✓ Analyse geladen: {name}

# analysisInfo
source: Analysis Information (optional)
de: Analyse Informationen (optional)

# partInfo
source: Part Information
de: Teil-Information

source: Part Number
de: Teil-Nummer

source: Part Name
de: Teil-Name

# specLimits
source: Specification Limits
de: Spezifikationsgrenzen

# upperLimit
source: Upper Limit (USL)
de: Obere Grenze (USL)

# lowerLimit
source: Lower Limit (LSL)
de: Untere Grenze (LSL)

# measurementSystem
source: Measuring Instrument
de: Messmittel

# instrumentName
source: Instrument Name / Serial Number
de: Messmittel-Name / Seriennummer

source: Analysis Details
de: Analyse Info

source: Analyzed By
de: Analysiert von

source: Reviewed By
de: Geprueft von

source: Department
de: Abteilung

# processOrOperation
source: Process / Operation
de: Prozess / Operation

source: Measurement Procedure
de: Messverfahren

source: Sampling Plan
de: Stichprobenplan

source: Drawing Reference
de: Zeichnungsreferenz

source: Instrument ID
de: Messmittel-ID

source: Calibration Status
de: Kalibrierstatus

# calibrationDate
source: Calibration Date (YYYY-MM-DD)
de: Kalibrierdatum (JJJJ-MM-TT)

# temperature
source: Temperature (C)
de: Temperatur (C)

source: Humidity (%)
de: Feuchte (%)

source: Number of Operators
de: Anzahl Pruefer

source: Number of Replicates
de: Wiederholungen

source: Number of Parts
de: Anzahl Teile

# discriminationSectionTitle
source: Discrimination & Resolution (AIAG)
de: Discrimination & Aufloesung (AIAG)

# resolutionPercentLabel
source: Resolution (% tolerance)
de: Aufloesung (% Toleranz)

# confidenceSectionTitle
source: Confidence Intervals & Control Limits
de: Konfidenzintervalle & Kontrollgrenzen

# ciLower
source: 95% CI Lower
de: 95% KI Untergrenze

# ciUpper
source: 95% CI Upper
de: 95% KI Obergrenze

# controlLimitLower
source: Control Limit (LCL)
de: Kontrollgrenze (LCL)

# controlLimitUpper
source: Control Limit (UCL)
de: Kontrollgrenze (UCL)

# processCapabilityTitle
source: Process Capability
de: Prozessfaehigkeit

# cpLabel
source: Cp (Potential)
de: Cp (Potenzial)

# cpkLabel
source: Cpk (Actual)
de: Cpk (Tatsaechlich)

# toleranceUsedPercentLabel
source: Tolerance Used
de: Toleranznutzung

source: N/A
de: k. A.

source: Customer
de: Kunde

source: Company
de: Unternehmen

# machine
source: Machine / Equipment
de: Maschine / Anlage

source: Select Language
de: Sprache wählen

# demoStep1Title
source: Analyze Your CSV File
de: Analysieren Sie Ihre CSV-Datei

# demoStep1Description
source: The CSV file will be automatically analyzed (1D, 2D direct or 2D distances)
de: Die CSV-Datei wird automatisch analysiert (1D, 2D direkt oder 2D Distanzen)

# demoStep3Title
source: Save Your Report
de: Speichern Sie Ihren Bericht

source: Select Theme
de: Design auswählen

source: Dataset Overview
de: Datensatz-Übersicht

# noMeasurementData
source: No measurement data for this mode (only for 2D distances)
de: Keine Messdaten für diesen Modus (nur für 2D Distanzen)

# demoAnalysisMode
source: Demo Analysis Mode (for sample data):
de: Demo-Analysemodus (für Demo-Daten):

source: Select CSV File
de: CSV-Datei auswählen

# fileOpenError
source: Error opening file: {error}
de: Fehler beim Öffnen der Datei: {error}

source: Select Analysis Mode
de: Analysemodus wählen

# howToAnalyze
source: How would you like to analyze this?
de: Wie möchten Sie diese analysieren?

# mode1DTooltip
source: X values only
de: Nur X-Werte

# mode2DDirectLabel
source: 2D direct
de: 2D direkt

# mode2DDirectTooltip
source: X,Y value pairs
de: X,Y Wertepaare

# mode2DDistancesLabel
source: 2D Distances
de: 2D Distanzen

# mode2DDistancesTooltip
source: Distances between points
de: Distanzen zwischen Punkten

# numMeasurements
source: Number of measurements: {count}
de: Anzahl Messungen: {count}

# firstMeasurement
source: First measurement: {value}
de: Erste Messung: {value}

# lastMeasurement
source: Last measurement: {value}
de: Letzte Messung: {value}

# modeSelectDirect
source: 2D direct (X,Y value pairs)
de: 2D direkt (X,Y Wertepaare)

# modeSelectDistances
source: 2D Distances (between point pairs)
de: 2D Distanzen (zwischen Punktparen)

# fileNotFound
source: File not found: {path}
de: Datei nicht gefunden: {path}

# errorLoadingFile
source: Error loading file: {error}
de: Fehler beim Laden der Datei: {error}

# error
source: Error: {error}
de: Fehler: {error}

# csvTwoColumnsInfo
source: This CSV has 2 columns (x,y).
de: Diese CSV hat 2 Spalten (x,y).
